Revit 2024 API
BuiltInFailures.CuttingFailures.UnableToReplaceWithLink Property
 Selected elements were copied to new file but Revit was unable to replace them with link to that file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId UnableToReplaceWithLink { get; }
Visual Basic
Public Shared ReadOnly Property UnableToReplaceWithLink As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UnableToReplaceWithLink {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CuttingFailures Class
Autodesk.Revit.DB Namespace